package pointless_attempts;

import java.util.Scanner;

public class Tin1 {
    public static void main(String[] args) {
        Scanner scanner = new Scanner(System.in);
        String line = scanner.nextLine();
        int counter = 0;
        for (int i = 0; i < 10; i++) {
            counter += line.contains(String.valueOf(i)) ? 1 : 0;
        }
        System.out.println(counter >= 8 ? "YES" : "NO");
    }
}

/*
Коля с Димой обмениваются зашифрованными сообщениями. Исходящее сообщение состоит только из десятичных цифр. При передаче сообщения через интернет некоторые цифры могут стираться, поэтому сообщение, которое получает собеседник, помимо цифр может содержать символ «?» (вопросительный знак).

Чтобы никто не мог вмешаться в переписку друзей, они шифруют сообщения специальным образом. Для этого они вставляют некоторую перестановку последовательности цифр от 0 до 9 в произвольное место сообщения.

Коля получил очередное сообщение и просит вас помочь узнать, мог ли это сообщение отправить его друг Дима?

Формат входных данных
В единственной строке входных данных дана строка из десятичных цифр и вопросительных знаков. Длина строки не превышает 2⋅10^5.

Формат выходных данных
Выведите одно слово "YES" (без кавычек), если такое сообщение мог отправить Дима, или "NO" (без кавычек), если это не так.

Пример 1
Ввод - 1234??7890
Вывод - YES

Пример 2
Ввод - 11223344550?2?4?6?80?6677889900
Вывод - YES

Пример 3
Ввод - 0?2?4?6?802?
Вывод - YES
*/